app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`) VALUES ('Pham Trung Hieu B', 'pham@gmail.com', '2022-05-09 02:31:55.201439', '2022-05-09 02:31:55.201439')

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `users`.`name` = 'Pham Trung Hieu C', `users`.`updated_at` = '2022-05-09 02:32:00.035228' WHERE `users`.`id` = 1